<?
/*  Выдать контрол для выбора слов для http://go/pages/condition_reflexes_basic_phrases.php
http://go/lib/get_exclamations.php
*/
header("Expires: Tue, 1 Jul 2003 05:00:00 GMT");
header("Last-Modified: " . gmdate("D, d M Y H:i:s") . " GMT");
header("Cache-Control: no-store, no-cache, must-revalidate");
header("Pragma: no-cache");
header('Content-Type: text/html; charset=UTF-8');

$id=$_GET['id'];

$exclamations=array(
"ага",
"ай",
"больно",
"бью",
"верю",
"вместе",
"да",
"давай",
"делай",
"дерусь",
"должен",
"еда",
"жаль",
"здорово",
"здравствуй",
"игнорирую",
"играть",
"интересно",
"испугался",
"ищу",
"кричу",
"лечу",
"люблю",
"мама",
"можешь",
"на",
"надо",
"накажу",
"накормлю",
"накормлю",
"научись",
"ненавижу",
"непонятно",
"нет",
"ну",
"нужно",
"о",
"обязан",
"ого",
"ой",
"оп",
"опасно",
"опасно",
"папа",
"плачу",
"плохо",
"понятно",
"понятно",
"попытайся",
"привет",
"приятно",
"прощаю",
"радую",
"рискни",
"родной",
"сделай",
"слушай",
"смеюсь",
"спокойно",
"страшно",
"стыдно",
"трудно",
"убью",
"уверен",
"ударю",
"улыбаюсь",
"ух",
"учи",
"хорошо",
"хочу",
"целую",
"чушь",
"эй",
"я",
"ясно"
);

sort($exclamations, SORT_STRING);
reset($exclamations);

$out="<table border=0 style='width:800px;font-size:14px;'><tr>";
	$nCol = 0;
	$n = 0;
foreach($exclamations as $word)
{
if(empty($word))
	continue;

if ($nCol == 6) { 
	$out.="</tr><tr>";
	$nCol = 0;
}									//exit($word);

$out.="<td align='left' style='cursor:pointer;' onClick='insert_word(".$id.",`".$word."`)'><nobr>".$word."</nobr></td>";
	
$nCol++;
$n++;
}
$out.="</tr></table>";

// синонимы для пусковых стимулов - кнопок на пульте
$out.="<div style='text-align:left;font-size:14px;'>";
$out.=set_str("Непонятно", "невероятно, странно, непонятно, неясно, возможно");
$out.=set_str("Понятно", "очевидно, естественно, понятно, ясно, вероятно");
$out.=set_str("Наказать", "убью, ударю, накажу, проучу, отругаю");
$out.=set_str("Поощрить", "оживляю, глажу, поощряю, награждаю, хвалю");
$out.=set_str("Накормить", "подавись, жри, ешь, подкрепись, кушай");
$out.=set_str("Успокоить", "сдохни, уймись, успокойся, спокойно, прости");
$out.=set_str("Поиграть", "побесимся?, развлечемся?, поиграем?, посоревнуемся?, подеремся?");
$out.=set_str("Поучить", "вникай, усвой, учи, занимайся, смотри");
$out.=set_str("Игнорировать", "плевать, пофиг, игнорирую, занят, мешаешь");
$out.=set_str("Сделать больно", "ударю, стукну, сделаю больно, уколю, шлепну");
$out.=set_str("Сделать приятно", "кайф, ты молодец, ты хороший, не дурно, хорошо");
$out.=set_str("Заплакать", "рыдаю, всхлипываю, плачу, грустно, обидно");
$out.=set_str("Засмеяться", "ржу, хохочу, смеюсь, улыбаюсь, смешно");
$out.=set_str("Обрадоваться", "восторгаюсь, класс, радуюсь, весело, прикольно");
$out.=set_str("Испугаться", "ужас, страшно, боюсь, тревожно, неуютно");
$out.=set_str("Простить", "благославляю, благодарю, прощаю, симпатизирую, сочувствую");
$out.=set_str("Вылечить", "будь здоров, живи, вылечил, заштопал, как новый");
$out.="</div>";


echo $out;

////////////////////////////////////////
function set_str($stimul, $sinonims)
{
	global $id;
$out="<nobr><span style='color:gray'>".$stimul.":</span>";
$sinonim=trim($sinonim);
$list=explode(',',$sinonims);
foreach($list as $word)
{
$word=trim($word);
if(empty($word))
	continue;
$out.="<span style='cursor:pointer;margin-left:30px;' onClick='insert_word(".$id.",`".$word."`)'>".$word."</span>";
}
$out.="</nobr><br>";

return $out;
}
/////////////////////////////////////////